CSI API ETABS v1

# cSapModelTreeIsUpdateSuspended Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int TreeIsUpdateSuspended(
    	ref bool IsSuspended
    )

    Function TreeIsUpdateSuspended (
    	ByRef IsSuspended As Boolean
    ) As Integer

    Dim instance As cSapModel
    Dim IsSuspended As Boolean
    Dim returnValue As Integer

    returnValue = instance.TreeIsUpdateSuspended(IsSuspended)

    int TreeIsUpdateSuspended(
    	bool% IsSuspended
    )

    abstract TreeIsUpdateSuspended :
            IsSuspended : bool byref -> int

#### Parameters

IsSuspended

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com